# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
# Mac Development Environment Brewfile
# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ

# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
# ๐ฆ Taps
# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"

# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
# ๐ง System & Core Dependencies
# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
brew "automake"
brew "bison"
brew "gdbm"
brew "gmp"
brew "libffi"
brew "libyaml"
brew "readline"
brew "pkg-config"
brew "cmake"
brew "ninja"

# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
# ๐ Security & Networking
# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
brew "openssl@3"
brew "gnupg"
brew "openssh"
brew "wget"
brew "curl"
brew "httpie"
brew "nmap"

# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
# ๐ Version Control & Git Tools
# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
brew "git"
brew "git-lfs"
brew "gh"                    # GitHub CLI
brew "glab"                  # GitLab CLI
brew "tig"                   # Text-mode Git repository browser
brew "lazygit"               # Simple terminal UI for git
brew "delta"                 # Syntax-highlighting pager for git

# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
# ๐ป Programming Languages & Runtime Management
# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
# Ruby
brew "chruby"
brew "ruby-install"

# Python
brew "python@3.11"
brew "python@3.12"
brew "pipenv"
brew "poetry"
# NOTE: pyenv removed to avoid conflicts with system Python and homebrew Python

# Node.js
brew "node"
brew "yarn"
brew "pnpm"
brew "fnm"                   # Fast Node Manager

# Other Languages
brew "go"
brew "rust"
brew "zig"
brew "deno"
brew "bun"

# JVM Languages
brew "openjdk@11"
brew "openjdk@17"
brew "openjdk@21"
brew "maven"
brew "gradle"

# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
# โ๏ธ  Cloud & Infrastructure
# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
brew "terraform"
brew "terragrunt"
brew "ansible"
brew "awscli"
brew "azure-cli"
brew "google-cloud-sdk"
brew "kubectl"
brew "helm"
brew "k9s"
brew "docker-compose"
brew "docker-credential-helper"

# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
# ๐๏ธ  Databases & Data Tools
# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
brew "postgresql@15"
brew "redis"
brew "sqlite"
brew "mysql"
brew "mongodb-community"

# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
# ๐๏ธ  Development Tools & Utilities
# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
brew "direnv"
brew "jq"
brew "yq"
brew "xmlstarlet"
brew "bat"
brew "exa"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "zoxide"
brew "tree"
brew "tmux"
brew "screen"
brew "htop"
brew "btop"
brew "ncdu"
brew "tldr"
brew "thefuck"

# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
# ๐จ Terminal & Shell Enhancement
# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"

# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
# ๐ System Monitoring & Performance
# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
brew "neofetch"
brew "bandwhich"
brew "dust"
brew "duf"

# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
# ๐ฑ GUI Applications
# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ

# Development IDEs & Editors
cask "visual-studio-code"
cask "cursor"
cask "jetbrains-toolbox"
cask "sublime-text"
cask "neovide"

# Terminal Applications
cask "iterm2"
cask "warp"
cask "alacritty"

# Development Tools
cask "docker"
cask "postman"
cask "insomnia"
cask "tableplus"
cask "sequel-pro"
cask "redis-insight"
cask "github-desktop"
cask "sourcetree"

# Design & Productivity
cask "figma"
cask "sketch"
cask "raycast"
cask "alfred"
cask "karabiner-elements"
cask "rectangle"
cask "obsidian"
cask "notion"

# Communication
cask "slack"
cask "discord"
cask "zoom"
cask "telegram"
cask "whatsapp"

# Media & Entertainment
cask "spotify"
cask "vlc"
cask "iina"

# Web Browsers
cask "google-chrome"
cask "firefox"
cask "arc"
cask "brave-browser"

# Utilities
cask "keka"
cask "appcleaner"
cask "coconutbattery"

# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
# ๐ค Fonts
# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-source-code-pro"
cask "font-cascadia-code"
cask "font-victor-mono"

# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
# ๐ Quick Look Plugins
# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "quicklook-csv"
cask "qlvideo"

# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
# ๐ช Mac App Store Applications
# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
brew "mas"

# Development
mas "Xcode", id: 497799835
mas "TestFlight", id: 899247664
mas "Core Data Lab", id: 1460684576

# Productivity
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Bear", id: 1091189122

# Utilities
mas "Amphetamine", id: 937984704
mas "CleanMyMac X", id: 1339170533
mas "Magnet", id: 441258766
mas "1Password", id: 443987910
mas "Fantastical", id: 975937182
mas "Things", id: 904280696
mas "Day One", id: 1055511498
mas "Deliveries", id: 290986013         
mas "Timing", id: 1046923112
mas "DaisyDisk", id: 411643860
mas "iStat Menus", id: 1289363302

# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
# ๐งน Maintenance Tools
# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
brew "brew-cask-upgrade"

# After running `brew bundle`, you can run the following commands to maintain your environment:
# brew update && brew upgrade              # Update and upgrade all packages
# brew cleanup                             # Remove old versions and caches
# mas upgrade                              # Upgrade Mac App Store apps
# brew cu -a                               # Upgrade all casks using brew-cask-upgrade
# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ
# End of Brewfile
# โโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโโ