# ───────────────────────────────
# Core CLI tools & languages
# ───────────────────────────────
brew "git"
brew "automake"
brew "bison"
brew "gdbm"
brew "gmp"
brew "libffi"
brew "libyaml"
brew "openssl@1.1"
brew "openssl@3"
brew "readline"
brew "chruby"
brew "ruby-install"
brew "python"
brew "go"
brew "node"
brew "terraform"
brew "direnv"
brew "jq"
brew "ripgrep"
brew "fd"
brew "exa"
brew "zoxide"
brew "tmux"
brew "starship"

# ───────────────────────────────
# Mac apps (GUI via Homebrew Cask)
# ───────────────────────────────
cask "iterm2"
cask "visual-studio-code"
cask "docker"
cask "raycast"
cask "obsidian"
cask "slack"
cask "spotify"
cask "google-chrome"

# ───────────────────────────────
# Fonts
# ───────────────────────────────
tap "homebrew/cask-fonts"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# ───────────────────────────────
# QuickLook Plugins (better file previews in Finder)
# ───────────────────────────────
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"

# ───────────────────────────────
# Mac App Store apps
# (requires `brew install mas` and App Store login)
# ───────────────────────────────
brew "mas"
mas "Xcode", id: 497799835
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Numbers", id: 409203825

# ───────────────────────────────
# Optional / reference catalog
# Uncomment any of these to install
# ───────────────────────────────
# brew "asdf"
# brew "awscli"
# brew "httpie"
# brew "neovim"
# brew "hugo"
# brew "pandoc"
# cask "alfred"
# cask "karabiner-elements"
# cask "telegram"
# cask "whatsapp"
# cask "vlc"
